Repository: SymKit/builder-bundle
Catalog: translations/validators.*.xlf
Languages: fr

# validation.block_code_unique
source: This block code already exists.
fr: Ce code de bloc existe déjà.

# validation.block_code_required
source: The block code is required.
fr: Le code du bloc est obligatoire.

# validation.block_code_snake_case
source: The code must be in snake_case (lowercase letters, numbers, and underscores only).
fr: Le code doit être en snake_case (lettres minuscules, chiffres et underscores uniquement).

# validation.label_required
source: The display label is required.
fr: Le libellé affiché est obligatoire.

# validation.category_required
source: A category must be selected.
fr: Une catégorie doit être sélectionnée.

# validation.icon_required
source: An icon identifier is required.
fr: Un identifiant d'icône est obligatoire.

# validation.category_code_unique
source: This category code already exists.
fr: Ce code de catégorie existe déjà.

# validation.category_code_required
source: The category code is required.
fr: Le code de catégorie est obligatoire.

# validation.category_code_snake_case
source: Code must be snake_case.
fr: Le code doit être en snake_case.

# validation.category_label_required
source: The category label is required.
fr: Le libellé de catégorie est obligatoire.

# validation.block_content_source.both
source: You must provide either a Twig template path OR HTML code, but not both.
fr: Vous devez renseigner soit un chemin de modèle Twig, soit du code HTML, mais pas les deux.

# validation.block_content_source.neither
source: You must provide either a Twig template path or HTML code.
fr: Vous devez renseigner un chemin de modèle Twig ou du code HTML.

# validation.json_invalid
source: Invalid JSON format.
fr: Format JSON invalide.
